In [3]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [4]:
labels = ['Felix','Hud','Abiral']
my_list = [1,4,5]
arr = np.array([1,4,5])
d = {'Felix':1,'Hud':4,'Abiral':5}

In [5]:
pd.Series(data=my_list)

0    1
1    4
2    5
dtype: int64

In [6]:
print("Familarity With Python")
pd.Series(data=my_list,index=labels)

Familarity With Python

Felix     1
Hud       4
Abiral    5
dtype: int64

In [7]:
pd.Series(data = arr)

0    1
1    4
2    5
dtype: int32

In [8]:
pd.Series(arr,labels)

Felix     1
Hud       4
Abiral    5
dtype: int32

In [9]:
ser = pd.Series(d)
ser

Felix     1
Hud       4
Abiral    5
dtype: int64

In [10]:
pd.Series(data=labels)

0     Felix
1       Hud
2    Abiral
dtype: object

In [11]:
ser['Hud']

4

In [12]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])        
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [13]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])     
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [14]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [15]:
ser1.add(ser2)

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [16]:
df = pd.DataFrame(randn(5,4),index=('A', 'B' ,'C','D','E'),columns='W X Y Z'.split())

In [17]:
df

          W         X         Y         Z
A  1.298883 -0.490062 -0.788897 -0.515040
B  0.226438  0.004550 -1.472894 -1.032125
C  0.506914 -0.695567 -0.565096  0.689739
D  2.208228 -1.347685 -1.766077  0.896051
E -1.901126  0.248877  0.135411 -1.033931

In [18]:
type(df)

pandas.core.frame.DataFrame

In [19]:
type(df['W'])

pandas.core.series.Series

In [20]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  1.298883 -0.490062 -0.788897 -0.515040  0.509986
B  0.226438  0.004550 -1.472894 -1.032125 -1.246456
C  0.506914 -0.695567 -0.565096  0.689739 -0.058182
D  2.208228 -1.347685 -1.766077  0.896051  0.442151
E -1.901126  0.248877  0.135411 -1.033931 -1.765715

In [21]:
df.drop('new',axis=1)

          W         X         Y         Z
A  1.298883 -0.490062 -0.788897 -0.515040
B  0.226438  0.004550 -1.472894 -1.032125
C  0.506914 -0.695567 -0.565096  0.689739
D  2.208228 -1.347685 -1.766077  0.896051
E -1.901126  0.248877  0.135411 -1.033931

In [22]:
df

          W         X         Y         Z       new
A  1.298883 -0.490062 -0.788897 -0.515040  0.509986
B  0.226438  0.004550 -1.472894 -1.032125 -1.246456
C  0.506914 -0.695567 -0.565096  0.689739 -0.058182
D  2.208228 -1.347685 -1.766077  0.896051  0.442151
E -1.901126  0.248877  0.135411 -1.033931 -1.765715

In [23]:
df.drop('new',axis=1,inplace=True)

In [24]:
df

          W         X         Y         Z
A  1.298883 -0.490062 -0.788897 -0.515040
B  0.226438  0.004550 -1.472894 -1.032125
C  0.506914 -0.695567 -0.565096  0.689739
D  2.208228 -1.347685 -1.766077  0.896051
E -1.901126  0.248877  0.135411 -1.033931

In [25]:
df.drop('C',axis=0)

          W         X         Y         Z
A  1.298883 -0.490062 -0.788897 -0.515040
B  0.226438  0.004550 -1.472894 -1.032125
D  2.208228 -1.347685 -1.766077  0.896051
E -1.901126  0.248877  0.135411 -1.033931

In [26]:
df

          W         X         Y         Z
A  1.298883 -0.490062 -0.788897 -0.515040
B  0.226438  0.004550 -1.472894 -1.032125
C  0.506914 -0.695567 -0.565096  0.689739
D  2.208228 -1.347685 -1.766077  0.896051
E -1.901126  0.248877  0.135411 -1.033931

In [27]:
# df.loc?

In [28]:
df

          W         X         Y         Z
A  1.298883 -0.490062 -0.788897 -0.515040
B  0.226438  0.004550 -1.472894 -1.032125
C  0.506914 -0.695567 -0.565096  0.689739
D  2.208228 -1.347685 -1.766077  0.896051
E -1.901126  0.248877  0.135411 -1.033931

In [29]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [30]:
df.loc['A']

W    1.298883
X   -0.490062
Y   -0.788897
Z   -0.515040
Name: A, dtype: float64

In [31]:
df.loc['B','Y']

-1.4728939322932784

In [32]:
df.loc[['A','B'],['W']]

          W
A  1.298883
B  0.226438

In [33]:
df.loc['A':'D','W':'Y']

          W         X         Y
A  1.298883 -0.490062 -0.788897
B  0.226438  0.004550 -1.472894
C  0.506914 -0.695567 -0.565096
D  2.208228 -1.347685 -1.766077

In [34]:
df.loc[df.W>0,:]

          W         X         Y         Z
A  1.298883 -0.490062 -0.788897 -0.515040
B  0.226438  0.004550 -1.472894 -1.032125
C  0.506914 -0.695567 -0.565096  0.689739
D  2.208228 -1.347685 -1.766077  0.896051

In [35]:
df.loc[:,'Y']

A   -0.788897
B   -1.472894
C   -0.565096
D   -1.766077
E    0.135411
Name: Y, dtype: float64

In [36]:
df

          W         X         Y         Z
A  1.298883 -0.490062 -0.788897 -0.515040
B  0.226438  0.004550 -1.472894 -1.032125
C  0.506914 -0.695567 -0.565096  0.689739
D  2.208228 -1.347685 -1.766077  0.896051
E -1.901126  0.248877  0.135411 -1.033931

In [37]:
df.iloc[2]

W    0.506914
X   -0.695567
Y   -0.565096
Z    0.689739
Name: C, dtype: float64

In [38]:
df.iloc[[2,4],1]

C   -0.695567
E    0.248877
Name: X, dtype: float64

In [39]:
list(df.W >0)

[True, True, True, True, False]

In [40]:
df.iloc[list(df.W >0),:]

          W         X         Y         Z
A  1.298883 -0.490062 -0.788897 -0.515040
B  0.226438  0.004550 -1.472894 -1.032125
C  0.506914 -0.695567 -0.565096  0.689739
D  2.208228 -1.347685 -1.766077  0.896051

In [41]:
df>0

       W      X      Y      Z
A   True  False  False  False
B   True   True  False  False
C   True  False  False   True
D   True  False  False   True
E  False   True   True  False

In [42]:
df[df>0]

          W         X         Y         Z
A  1.298883       NaN       NaN       NaN
B  0.226438  0.004550       NaN       NaN
C  0.506914       NaN       NaN  0.689739
D  2.208228       NaN       NaN  0.896051
E       NaN  0.248877  0.135411       NaN